/* আমাদের মেইন এ থাকা পয়েন্টার টি এমন ভাবে পাস করতে হবে যাতে করে, মেইন ফাংশনে থেকে পয়েন্টার এর কপি ক্রিয়েট না হয়ে সরাসরি পয়েন্টার টি পাস হয়। এই ক্ষেত্রে আমাদের টাইপ ২ঃ কল বাই রেফারেন্স এর সাহায্য নিতে হবে। আমরা যদি ফাংশনে এ রেফারেন্স সহকারে অর্থাৎ এড্রেস (&) সহকারে ফাংশন তৈরি করি সেই ক্ষেত্রে main থেকে ফাংশনে পয়েন্টার টি পাস করার সময় কোনো কপি ক্রিয়েট না হয়ে সরাসরি ঐ পয়েন্টার টি পাস হবে। এবং ফাংশনে ঐ পয়েন্টার এর উপর যে যে অপারেশন করা হয়, সব মেইন ফাংশনে পরিলক্ষিত হবে।

*/
#include <bits/stdc++.h>

using namespace std;

void fun(int *&p)

{ // pass by reference

    //p = NULL; // p is now NULL
}

int main()

{

    int a = 10;

    int *p = &a;

    fun(p); // call by reference

    if (p == NULL)
    {

        cout << "Pointer pointing to NULL " << endl;
    }

    else
    {

        cout << *p << endl;
    }
}

// Output : Pointer pointing to NULL
